Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# Tip.0044.Body
source: Hold ⌥ and click to move your cursor. It works best with Shell Integration installed (to avoid sending up/down arrow keys to your shell).
de: Halten Sie ⌥ gedrückt und klicken Sie, um Ihren Cursor zu bewegen. Am besten funktioniert das mit installierter Shell-Integration (um zu vermeiden, dass die Pfeiltasten „nach oben“ und „nach unten“ an Ihre Shell gesendet werden).
ja: ⌥を押しながらクリックすると、カーソルを移動できます。シェル統合をインストールしていると最も効果的に機能します(シェルに上下矢印キーを送らずに済みます)。
pt_br: Mantenha ⌥ pressionado e clique para mover o cursor. Funciona melhor com o Shell Integration instalado (para evitar o envio das teclas de seta para cima/baixo ao shell).
ru: Удерживайте ⌥ и щёлкайте, чтобы переместить курсор. Лучше всего это работает при установленной интеграции с оболочкой (чтобы избежать отправки клавиш со стрелками вверх/вниз в оболочку).
zh_hans: 按住 ⌥ 键并点击以移动光标。此功能在已安装 Shell Integration 时效果最佳（以避免将向上/向下箭头键发送到 shell）。

# Tip.0044.Title
source: Move Cursor
de: Cursor bewegen
ja: カーソルの移動
pt_br: Mover cursor
ru: Перемещение курсора
zh_hans: 移动光标

# Tip.0045.Body
source: You can tell your profile to create windows that are attached to one edge of the screen in “Settings > Profiles > Window.” You can resize them by dragging the edges.
de: Sie können Ihrem Profil unter „Einstellungen > Profile > Fenster“ mitteilen, dass es Fenster erzeugen soll, die an einem Bildschirmrand andocken. Sie können deren Größe durch Ziehen der Ränder ändern.
ja: 「設定 > プロファイル > ウィンドウ」で、画面の端に固定されたウィンドウを作成するようプロファイルに指定できます。端をドラッグしてサイズを変更できます。
pt_br: Você pode configurar seu perfil para criar janelas fixadas em uma das bordas da tela em “Ajustes > Perfis > Janela”. Você pode redimensioná-las arrastando as bordas.
ru: Вы можете настроить профиль так, чтобы он создавал окна, прикреплённые к одному из краёв экрана, в «Настройки > Профили > Окно». Их можно изменять в размере, перетаскивая края.
zh_hans: 你可以在“设置 > 配置文件 > 窗口”中让你的配置文件创建固定在屏幕一边的窗口。你可以通过拖动边缘来调整其大小。

# Tip.0045.Title
source: Edge Windows
de: Randfenster
ja: エッジウィンドウ
pt_br: Janelas nas bordas
ru: Окна у края экрана
zh_hans: 屏幕贴边窗口

# Tip.0046.Body
source: You can assign colors to tabs in “Settings > Profiles > Colors,” or in the View menu.
de: Sie können Tabs Farben zuweisen, entweder unter „Einstellungen > Profile > Farben“ oder im Menü „Ansicht“.
ja: 「設定 > プロファイル > カラー」、または表示メニューでタブに色を割り当てられます。
pt_br: Você pode atribuir cores às abas em “Ajustes > Perfis > Cores” ou no menu Visualizar.
ru: Вы можете назначать цвета вкладкам в «Настройки > Профили > Цвета» или в меню «Вид».
zh_hans: 您可以在“Settings > Profiles > Colors”或View菜单中为标签页分配颜色。

# Tip.0046.Title
source: Tab Color
de: Tab-Farbe
ja: タブの色
pt_br: Cor da aba
ru: Цвет вкладки
zh_hans: 标签页颜色

# Tip.0047.Body
source: Hold ⌥⌘ while dragging to make a rectangular selection.
de: Halten Sie beim Ziehen ⌥⌘ gedrückt, um eine rechteckige Auswahl zu erstellen.
ja: ⌥⌘を押しながらドラッグすると、矩形選択ができます。
pt_br: Mantenha ⌥⌘ pressionado ao arrastar para fazer uma seleção retangular.
ru: Удерживайте ⌥⌘ при перетаскивании, чтобы сделать прямоугольное выделение.
zh_hans: 拖动时按住⌥⌘可创建矩形选择区域。

# Tip.0047.Title
source: Rectangular Selection
de: Rechteckige Auswahl
ja: 矩形選択
pt_br: Seleção retangular
ru: Прямоугольное выделение
zh_hans: 矩形选择区域

# Tip.0048.Body
source: Hold ⌘ while dragging to make multiple discontinuous selections.
de: Halten Sie beim Ziehen ⌘ gedrückt, um mehrere nicht zusammenhängende Auswahlen zu erstellen.
ja: ⌘を押しながらドラッグすると、複数の不連続な選択ができます。
pt_br: Mantenha ⌘ pressionado ao arrastar para fazer várias seleções descontínuas.
ru: Удерживайте ⌘ при перетаскивании, чтобы сделать несколько несвязанных выделений.
zh_hans: 在拖动时按住 ⌘ 键，可实现不连续的多选操作。

# Tip.0048.Title
source: Multiple Selection
de: Mehrfachauswahl
ja: 複数選択
pt_br: Seleção múltipla
ru: Множественное выделение
zh_hans: 多选功能

# Tip.0049.Body
source: Hold ⇧⌥⌘ and drag a session into another session to create or change split panes.
de: Halten Sie ⇧⌥⌘ gedrückt und ziehen Sie eine Sitzung in eine andere, um geteilte Bereiche zu erstellen oder zu ändern.
ja: ⇧⌥⌘を押しながらセッションを別のセッションにドラッグすると、分割ペインを作成したり変更したりできます。
pt_br: Mantenha ⇧⌥⌘ pressionado e arraste uma sessão para outra sessão para criar ou alterar painéis divididos.
ru: Удерживайте ⇧⌥⌘ и перетащите одну сессию в другую, чтобы создать или изменить разделённые панели.
zh_hans: 按住 ⇧⌥⌘ 键并拖动一个会话到另一个会话中，可创建或更改分屏窗格。

# Tip.0049.Title
source: Dragging Panes
de: Bereiche ziehen
ja: ペインのドラッグ
pt_br: Arrastar painéis
ru: Перетаскивание панелей
zh_hans: 窗格的拖动操作

# Tip.0050.Body
source: Adjust Cursor Boost in “Settings > Profiles > Colors” to make all colors more muted, except the cursor. Use a bright white cursor and it pops!
de: Passen Sie Cursor-Boost unter „Einstellungen > Profile > Farben“ an, damit alle Farben gedämpfter wirken, außer dem Cursor. Verwenden Sie einen leuchtend weißen Cursor, damit er richtig heraussticht!
ja: 「設定 > プロファイル > カラー」でカーソルブーストを調整すると、カーソル以外のすべての色を控えめにできます。明るい白のカーソルを使えば、くっきりと際立ちます!
pt_br: Ajuste o Realce do cursor em “Ajustes > Perfis > Cores” para deixar todas as cores mais suaves, exceto o cursor. Use um cursor branco brilhante e ele se destaca!
ru: Настройте «Усиление курсора» в «Настройки > Профили > Цвета», чтобы сделать все цвета более приглушёнными, кроме курсора. Используйте ярко-белый курсор, и он будет выделяться!
zh_hans: 在“设置 > 配置文件 > 颜色”中调整光标增强功能，使所有颜色变暗，仅保留光标为亮色。若使用明亮的白色光标，会非常显眼！

# Tip.0051.Body
source: Adjust “Minimum Contrast” in “Settings > Profiles > Colors” to ensure text is always legible regardless of text/background color combination.
de: Passen Sie „Mindestkontrast“ unter „Einstellungen > Profile > Farben“ an, damit Text unabhängig von der Kombination aus Text- und Hintergrundfarbe immer lesbar bleibt.
ja: 「設定 > プロファイル > カラー」で「最小コントラスト」を調整すると、文字色と背景色の組み合わせにかかわらず、常にテキストを読みやすくできます。
pt_br: Ajuste “Contraste mínimo” em “Ajustes > Perfis > Cores” para garantir que o texto seja sempre legível, independentemente da combinação de cores de texto e fundo.
ru: Настройте «Минимальный контраст» в «Настройки > Профили > Цвета», чтобы текст всегда оставался читаемым независимо от сочетания цветов текста и фона.
zh_hans: 在“设置 > 配置文件 > 颜色”中调整“最小对比度”，以确保无论文本与背景颜色如何组合，文本始终清晰可辨。

# Tip.0051.Title
source: Minimum Contrast
de: Mindestkontrast
ja: 最小コントラスト
pt_br: Contraste mínimo
ru: Минимальный контраст
zh_hans: 最小对比度

# Tip.0052.Body
source: Normally, new tabs appear at the end of the tab bar. There’s a setting in “Settings > Advanced” to place them next to your current tab.
de: Normalerweise erscheinen neue Tabs am Ende der Tab-Leiste. Unter „Einstellungen > Erweitert“ gibt es eine Einstellung, mit der sie stattdessen neben dem aktuellen Tab platziert werden.
ja: 通常、新しいタブはタブバーの末尾に表示されます。「設定 > 詳細」の設定で、現在のタブの隣に配置することもできます。
pt_br: Normalmente, novas abas aparecem no fim da barra de abas. Há um ajuste em “Ajustes > Avançado” para colocá-las ao lado da aba atual.
ru: Обычно новые вкладки появляются в конце панели вкладок. В «Настройки > Дополнительные» есть параметр, позволяющий размещать их рядом с текущей вкладкой.
zh_hans: 通常，新标签页会出现在标签页栏的末尾。在“设置 > 高级”中有一个设置可以将它们放在当前标签页旁边。

# Tip.0053.Body
source: Right-click on a number and the context menu shows it converted to hex or decimal as appropriate.
de: Klicken Sie mit der rechten Maustaste auf eine Zahl, und das Kontextmenü zeigt sie je nach Bedarf in hexadezimaler oder dezimaler Form an.
ja: 数値を右クリックすると、コンテキストメニューにその数値を16進数または10進数に変換した値が表示されます。
pt_br: Clique com o botão direito em um número e o menu de contexto o mostrará convertido para hexadecimal ou decimal, conforme apropriado.
ru: Щёлкните правой кнопкой мыши по числу, и контекстное меню покажет его перевод в шестнадцатеричную или десятичную систему в зависимости от ситуации.
zh_hans: 在数字上右键点击时，上下文菜单会显示对应的十六进制或十进制数值。

# Tip.0053.Title
source: Base Conversion
de: Basisumwandlung
ja: 基数変換
pt_br: Conversão de base
ru: Преобразование систем счисления
zh_hans: 进制转换

# Tip.0054.Body
source: In “Settings > Keys” you can assign a keystroke to a search for a regular expression with the “Find Regular Expression…” action.
de: Unter „Einstellungen > Tasten“ können Sie mit der Aktion „Regulären Ausdruck suchen…“ einem Tastendruck eine Suche nach einem regulären Ausdruck zuweisen.
ja: 「設定 > キー」では、「正規表現を検索…」アクションを使って、正規表現の検索にキー操作を割り当てられます。
pt_br: Em “Ajustes > Teclas” você pode atribuir um atalho de teclado a uma busca por expressão regular com a ação “Buscar expressão regular…”.
ru: В «Настройки > Клавиши» можно назначить сочетание клавиш для поиска по регулярному выражению с помощью действия «Найти регулярное выражение…».
zh_hans: 在“设置 > 按键”中，可以通过“查找正则表达式…”功能将按键与正则表达式搜索关联起来。

# Tip.0054.Title
source: Saved Searches
de: Gespeicherte Suchen
ja: 保存された検索
pt_br: Buscas salvas
ru: Сохранённые поиски
zh_hans: 已保存的搜索

# Tip.0055.Body
source: Search for URLs using “Edit > Find > Find URLs.” Navigate search results with ⌘G and ⇧⌘G. Open the current selection with ⌥⌘O.
de: Suchen Sie nach URLs mit „Bearbeiten > Suchen > URLs suchen“. Navigieren Sie mit ⌘G und ⇧⌘G durch die Suchergebnisse. Öffnen Sie die aktuelle Auswahl mit ⌥⌘O.
ja: 「編集 > 検索 > URLを検索」を使ってURLを検索できます。⌘Gと⇧⌘Gで検索結果を移動し、⌥⌘Oで現在の選択範囲を開けます。
pt_br: Busque URLs usando “Editar > Buscar > Buscar URLs”. Navegue pelos resultados da busca com ⌘G e ⇧⌘G. Abra a seleção atual com ⌥⌘O.
ru: Ищите URL-адреса с помощью «Правка > Найти > Найти URL-адреса». Переходите между результатами поиска с помощью ⌘G и ⇧⌘G. Открывайте текущее выделение с помощью ⌥⌘O.
zh_hans: 使用“编辑 > 查找 > 查找 URL”功能进行 URL 搜索。可通过 ⌘G 和 ⇧⌘G 浏览搜索结果，用 ⌥⌘O 打开当前选中项。

# Tip.0055.Title
source: Find URLs
de: URLs suchen
ja: URLを検索
pt_br: Buscar URLs
ru: Поиск URL-адресов
zh_hans: 查找 URL

# Tip.0056.Body
source: The “instant” checkbox in a Trigger allows it to fire while the cursor is on the same line as the text that matches your regular expression.
de: Mit dem Kontrollkästchen „Sofort“ in einem Trigger kann dieser bereits ausgelöst werden, während sich der Cursor noch in derselben Zeile wie der zu Ihrem regulären Ausdruck passende Text befindet.
ja: トリガーの「即時」チェックボックスをオンにすると、正規表現に一致するテキストと同じ行にカーソルがある間もトリガーを発火させられます。
pt_br: A caixa de seleção “instantâneo” em um gatilho permite que ele seja acionado enquanto o cursor está na mesma linha do texto que corresponde à sua expressão regular.
ru: Флажок «мгновенно» в триггере позволяет ему срабатывать, пока курсор находится на той же строке, что и текст, соответствующий регулярному выражению.
zh_hans: 在 Trigger 中的“即时”复选框允许在光标位于与正则表达式匹配的文本同一行时触发。

# Tip.0056.Title
source: Triggers
de: Trigger
ja: トリガー
pt_br: Gatilhos
ru: Триггеры
zh_hans: 触发器

# Tip.0057.Body
source: Turn on “Edit > Selection Respects Soft Boundaries” to recognize split pane dividers in programs like vi, emacs, and tmux so you can select multiple lines of text.
de: Aktivieren Sie „Bearbeiten > Auswahl berücksichtigt weiche Grenzen“, damit Trennlinien geteilter Bereiche in Programmen wie vi, emacs und tmux erkannt werden, sodass Sie mehrere Textzeilen auswählen können.
ja: 「編集 > 選択範囲でソフト境界を考慮」をオンにすると、vi、emacs、tmuxなどのプログラムで分割ペインの区切りを認識できるようになり、複数行のテキストを選択できます。
pt_br: Ative “Editar > A seleção respeita limites flexíveis” para reconhecer divisórias de painéis em programas como vi, emacs e tmux, permitindo selecionar várias linhas de texto.
ru: Включите «Правка > Выделение учитывает мягкие границы», чтобы распознавать разделители панелей в таких программах, как vi, emacs и tmux, и выделять несколько строк текста.
zh_hans: 打开“编辑 > 选择遵循软边界”以识别 vi、emacs 和 tmux 等程序中的分屏窗格分隔线，从而可以选择多行文本。

# Tip.0057.Title
source: Soft Boundaries
de: Weiche Grenzen
ja: ソフト境界
pt_br: Limites flexíveis
ru: Мягкие границы
zh_hans: 软边界

# Tip.0058.Body
source: Single click where you want to start a selection and ⇧-click where you want it to end to select text without dragging.
de: Klicken Sie einmal dort, wo die Auswahl beginnen soll, und ⇧-klicken Sie dort, wo sie enden soll, um Text ohne Ziehen auszuwählen.
ja: 選択を開始したい場所をクリックし、終了したい場所を⇧クリックすると、ドラッグせずにテキストを選択できます。
pt_br: Clique uma vez onde deseja iniciar uma seleção e ⇧-clique onde deseja terminá-la para selecionar texto sem arrastar.
ru: Щёлкните один раз там, где нужно начать выделение, а затем ⇧-щёлкните там, где оно должно закончиться, чтобы выделить текст без перетаскивания.
zh_hans: 单次点击即可选择开始位置，使用 ⇧- 点击指定结束位置可无拖拽选中文本。

# Tip.0058.Title
source: Select Without Dragging
de: Auswählen ohne Ziehen
ja: ドラッグせずに選択
pt_br: Selecionar sem arrastar
ru: Выделение без перетаскивания
zh_hans: 无拖拽选择功能

# Tip.0059.Body
source: Hold ^ while resizing a window and it won’t snap to the character grid: you can make it any size you want.
de: Halten Sie ^ gedrückt, während Sie die Größe eines Fensters ändern, damit es nicht am Zeichenraster einrastet: So können Sie es auf jede beliebige Größe bringen.
ja: ^を押しながらウィンドウのサイズを変更すると、文字グリッドにスナップしなくなり、好きなサイズに調整できます。
pt_br: Mantenha ^ pressionado ao redimensionar uma janela e ela não se ajustará à grade de caracteres: você pode deixá-la com qualquer tamanho.
ru: Удерживайте ^ при изменении размера окна, и оно не будет привязываться к сетке символов: вы сможете сделать его любого размера.
zh_hans: 调整窗口大小时按住 ^ 键，窗口不会自动对齐字符网格；可任意设置大小。

# Tip.0059.Title
source: Smooth Window Resizing
de: Stufenlose Fenstergrößenänderung
ja: スムーズなウィンドウのリサイズ
pt_br: Redimensionamento suave de janelas
ru: Плавное изменение размера окна
zh_hans: 流畅的窗口调整功能

# Tip.0060.Body
source: If you paste text containing tabs, you’ll be asked if you want to convert them to spaces. It’s handy at the shell prompt to avoid triggering filename completion.
de: Wenn Sie Text einfügen, der Tabulatoren enthält, werden Sie gefragt, ob diese in Leerzeichen umgewandelt werden sollen. Das ist an der Shell-Eingabeaufforderung praktisch, um eine ungewollte Dateinamenvervollständigung zu vermeiden.
ja: タブ文字を含むテキストをペーストすると、スペースに変換するかどうか尋ねられます。シェルプロンプトでファイル名補完が誤って発動するのを防ぐのに便利です。
pt_br: Se você colar texto com tabulações, será perguntado se deseja convertê-las em espaços. Isso é útil no prompt do shell para evitar acionar o preenchimento automático de nomes de arquivo.
ru: Если вы вставляете текст, содержащий табуляции, вас спросят, хотите ли вы преобразовать их в пробелы. Это удобно в приглашении оболочки, чтобы не запускать автодополнение имён файлов.
zh_hans: 粘贴包含标签页的文本时，系统会询问是否将其转换为空格。在终端提示符下使用此功能可避免触发文件名补全。

# Tip.0060.Title
source: Pasting Tabs
de: Einfügen von Tabulatoren
ja: タブのペースト
pt_br: Colar tabulações
ru: Вставка табуляций
zh_hans: 粘贴制表符

# Tip.0061.Body
source: Did you know? If the bell rings too often, you’ll be asked if you’d like to silence it temporarily. iTerm2 cares about your comfort.
de: Wussten Sie schon? Wenn der Signalton zu häufig ertönt, werden Sie gefragt, ob Sie ihn vorübergehend stummschalten möchten. iTerm2 legt Wert auf Ihren Komfort.
ja: ご存じでしたか?ベルが頻繁に鳴りすぎると、一時的に消音するかどうか尋ねられます。iTerm2はあなたの快適さを大切にしています。
pt_br: Você sabia? Se a campainha tocar com muita frequência, será perguntado se você deseja silenciá-la temporariamente. O iTerm2 se importa com o seu conforto.
ru: А вы знали? Если звуковой сигнал звучит слишком часто, вам предложат временно его отключить. iTerm2 заботится о вашем комфорте.
zh_hans: 你知道吗？如果铃声响得太频繁，系统会询问你是否希望暂时关闭它。iTerm2注重你的使用体验。

# Tip.0061.Title
source: Bell Silencing
de: Signalton stummschalten
ja: ベルの消音
pt_br: Silenciamento da campainha
ru: Отключение сигнала
zh_hans: 铃声静音设置

# Tip.0062.Body
source: Every list of profiles has a search field (e.g., in ”Settings > Profiles.”) You can use various operators to restrict your search query. Click “Learn More” for all the details.
de: Jede Profilliste verfügt über ein Suchfeld (zum Beispiel unter „Einstellungen > Profile“). Sie können verschiedene Operatoren verwenden, um Ihre Suchanfrage einzugrenzen. Klicken Sie auf „Mehr erfahren“, um alle Details zu erfahren.
ja: プロファイルの一覧には必ず検索フィールドがあります(たとえば「設定 > プロファイル」)。さまざまな演算子を使って検索クエリを絞り込めます。詳細は「詳しくはこちら」をクリックしてください。
pt_br: Toda lista de perfis tem um campo de busca (por exemplo, em “Ajustes > Perfis”). Você pode usar vários operadores para restringir sua consulta de busca. Clique em “Saiba mais” para todos os detalhes.
ru: В каждом списке профилей есть поле поиска (например, в «Настройки > Профили»). Вы можете использовать различные операторы, чтобы уточнить поисковый запрос. Нажмите «Подробнее», чтобы узнать все детали.
zh_hans: 每个配置文件列表都包含搜索字段（例如在“设置 > 配置文件”中）。你可以使用各种运算符来限制搜索查询。点击“了解更多”可获取所有详情。

# Tip.0062.Title
source: Profile Search
de: Profilsuche
ja: プロファイル検索
pt_br: Busca de perfis
ru: Поиск по профилям
zh_hans: 配置文件搜索

# Tip.0063.Body
source: The online color gallery features over one hundred beautiful color schemes you can download.
de: Die Online-Farbgalerie bietet über hundert wunderschöne Farbschemata zum Herunterladen.
ja: オンラインカラーギャラリーには、ダウンロードできる100種類以上の美しいカラースキームが用意されています。
pt_br: A galeria de cores on-line oferece mais de cem belos esquemas de cores que você pode transferir.
ru: В онлайн-галерее цветов представлено более ста прекрасных цветовых схем, которые можно загрузить.
zh_hans: 该在线颜色图库提供超过一百种精美的颜色方案，可供下载使用。

# Tip.0063.Title
source: Color Schemes
de: Farbschemata
ja: カラースキーム
pt_br: Esquemas de cores
ru: Цветовые схемы
zh_hans: 颜色方案

# Tip.0064.Body
source: You can have a separate font for ASCII versus non-ASCII text. Enable it in “Settings > Profiles > Text.”
de: Sie können für ASCII- und Nicht-ASCII-Text jeweils eine eigene Schriftart verwenden. Aktivieren Sie dies unter „Einstellungen > Profile > Text“.
ja: ASCII文字と非ASCII文字で別々のフォントを使用できます。「設定 > プロファイル > テキスト」で有効にしてください。
pt_br: Você pode ter uma fonte separada para texto ASCII e não ASCII. Ative isso em “Ajustes > Perfis > Texto”.
ru: Вы можете использовать отдельные шрифты для ASCII и не-ASCII текста. Включите это в «Настройки > Профили > Текст».
zh_hans: 您可以为ASCII与非ASCII文本设置独立的字体。在“设置 > 配置文件 > 文本”中启用此选项。

# Tip.0064.Title
source: ASCII/Non-Ascii Fonts
de: ASCII-/Nicht-ASCII-Schriftarten
ja: ASCII/非ASCIIフォント
pt_br: Fontes ASCII/não ASCII
ru: Шрифты ASCII/не-ASCII
zh_hans: ASCII/非ASCII字体

# Tip.0065.Body
source: A coprocess is a job, such as a shell script, that has a special relationship with a particular iTerm2 session. All output in a terminal window (that is, what you see on the screen) is also input to the coprocess. All output from the coprocess acts like text that the user is typing at the keyboard.
de: Ein Koprozess ist ein Vorgang, etwa ein Shellskript, der in einer besonderen Beziehung zu einer bestimmten iTerm2-Sitzung steht. Jede Ausgabe in einem Terminalfenster (also alles, was Sie auf dem Bildschirm sehen) wird auch als Eingabe an den Koprozess weitergegeben. Jede Ausgabe des Koprozesses verhält sich wie Text, den der Benutzer über die Tastatur eingibt.
ja: コプロセスとは、特定のiTerm2セッションと特別な関係を持つ、シェルスクリプトなどのジョブです。ターミナルウィンドウのすべての出力(つまり画面に表示される内容)は、コプロセスへの入力にもなります。コプロセスからのすべての出力は、ユーザーがキーボードで入力したテキストのように扱われます。
pt_br: Um coprocesso é uma tarefa, como um shell script, que tem uma relação especial com uma sessão específica do iTerm2. Toda a saída em uma janela de terminal (ou seja, o que você vê na tela) também é entrada para o coprocesso. Toda a saída do coprocesso age como texto que o usuário está digitando no teclado.
ru: Сопроцесс представляет собой задачу, например сценарий оболочки, имеющую особую связь с конкретной сессией iTerm2. Весь вывод в окне терминала (то есть то, что вы видите на экране) также подаётся на вход сопроцессу. А весь вывод сопроцесса ведёт себя как текст, который пользователь набирает на клавиатуре.
zh_hans: 协处理器是一种与特定iTerm2会话有特殊关系的作业，例如shell脚本。终端窗口中的所有输出（即屏幕显示的内容）也是该协处理器的输入。协处理器输出的内容就像用户在键盘上输入的文本一样。

# Tip.0065.Title
source: Coprocesses
de: Koprozesse
ja: コプロセス
pt_br: Coprocessos
ru: Сопроцессы
zh_hans: 协处理器

# Tip.0066.Body
source: You can customize the touch bar by selecting “View > Customize Touch Bar.” You can add a tab bar for full-screen mode, a user-customizable status button, and you can even define your own touch bar buttons in Settings > Keys. There’s also a new shell integration tool to customize touch bar function key labels.
de: Sie können die Touch Bar anpassen, indem Sie „Ansicht > Touch Bar anpassen“ wählen. Sie können eine Tab-Leiste für den Vollbildmodus sowie eine benutzerdefinierbare Statusschaltfläche hinzufügen und sogar eigene Touch-Bar-Schaltflächen unter „Einstellungen > Tasten“ festlegen. Außerdem gibt es ein neues Shell-Integration-Werkzeug, um die Beschriftungen der Funktionstasten auf der Touch Bar anzupassen.
ja: 「表示 > Touch Barをカスタマイズ」を選択すると、Touch Barをカスタマイズできます。フルスクリーンモード用のタブバーや、ユーザーがカスタマイズできるステータスボタンを追加でき、設定 > キーで独自のTouch Barボタンを定義することもできます。Touch Barのファンクションキーラベルをカスタマイズする新しいシェル統合ツールもあります。
pt_br: Você pode personalizar a Touch Bar selecionando “Visualizar > Personalizar Touch Bar”. Você pode adicionar uma barra de abas para o modo de tela cheia, um botão de status personalizável pelo usuário e até definir seus próprios botões da Touch Bar em Ajustes > Teclas. Há também uma nova ferramenta de Shell Integration para personalizar os rótulos das teclas de função da Touch Bar.
ru: Вы можете настроить Touch Bar, выбрав «Вид > Настроить Touch Bar». Можно добавить панель вкладок для полноэкранного режима, настраиваемую пользователем кнопку статуса, а также определить собственные кнопки Touch Bar в «Настройки > Клавиши». Также есть новый инструмент интеграции с оболочкой для настройки подписей функциональных клавиш Touch Bar.
zh_hans: 您可以通过选择“View > Customize Touch Bar”来自定义触摸栏。您可以添加全屏模式的标签页栏、可自定义的状态按钮，甚至可以在设置中的“Keys”里定义自己的触摸栏按钮。还有新的shell集成工具用于自定义触摸栏功能键标签。

# Tip.0066.Title
source: Touch Bar Customization
de: Touch Bar anpassen
ja: Touch Barのカスタマイズ
pt_br: Personalização da Touch Bar
ru: Настройка Touch Bar
zh_hans: 触摸栏定制

# Tip.0067.Body
source: If you use a font that supports ligatures, you can enable ligature support in Settings > Profiles > Text.
de: Wenn Sie eine Schriftart verwenden, die Ligaturen unterstützt, können Sie die Ligaturunterstützung unter „Einstellungen > Profile > Text“ aktivieren.
ja: リガチャに対応したフォントを使っている場合は、設定 > プロファイル > テキストでリガチャのサポートを有効にできます。
pt_br: Se você usa uma fonte que suporta ligaduras, pode ativar o suporte a ligaduras em Ajustes > Perfis > Texto.
ru: Если вы используете шрифт с поддержкой лигатур, вы можете включить их поддержку в «Настройки > Профили > Текст».
zh_hans: 如果您使用支持连字效果的字体，可以在设置中的“Profiles > Text”里启用连字支持。

# Tip.0067.Title
source: Ligatures
de: Ligaturen
ja: リガチャ
pt_br: Ligaduras
ru: Лигатуры
zh_hans: 连字效果

# Tip.0068.Body
source: New in 3.1: You can configure your hotkey window to appear over other apps’ full screen windows. Turn on “Floating Window” in “Settings > Profiles > Keys > Customize Hotkey Window.”
de: Neu in 3.1: Sie können Ihr Hotkey-Fenster so konfigurieren, dass es über den Vollbildfenstern anderer Apps erscheint. Aktivieren Sie „Schwebendes Fenster“ unter „Einstellungen > Profile > Tasten > Hotkey-Fenster anpassen“.
ja: 3.1の新機能: ホットキーウィンドウを他のアプリのフルスクリーンウィンドウの上に表示するよう設定できます。「設定 > プロファイル > キー > ホットキーウィンドウをカスタマイズ」で「フローティングウィンドウ」をオンにしてください。
pt_br: Novidade na 3.1: você pode configurar sua janela de atalho para aparecer sobre as janelas de tela cheia de outros apps. Ative “Janela flutuante” em “Ajustes > Perfis > Teclas > Personalizar janela de atalho”.
ru: Новое в 3.1: вы можете настроить окно горячих клавиш так, чтобы оно появлялось поверх полноэкранных окон других приложений. Включите «Плавающее окно» в «Настройки > Профили > Клавиши > Настроить окно горячих клавиш».
zh_hans: 3.1新功能：你可以将热键窗口配置为在其他应用程序全屏窗口上方显示。在“设置 > 配置文件 > 按键 > 自定义热键窗口”中开启“浮动窗口”选项。

# Tip.0068.Title
source: Floating Hotkey Window
de: Schwebendes Hotkey-Fenster
ja: フローティングホットキーウィンドウ
pt_br: Janela de atalho flutuante
ru: Плавающее окно горячих клавиш
zh_hans: 浮动热键窗口
